[
  {
    "name": "Wingonia Ikpi",
    "role": "Founder",
    "info": "Wingonia Ikpi is a film enthusiast and passionate storyteller with years of experience in different areas of the entertainment value chain. A lover of cinema and all its excesses, Wingonia values nuance, production quality and ambition as an essential benchmark in the world of filmmaking.\n\nWingonia’s footprints have been on various platforms, adding valuable contributions to numerous aspects of productions. With a skill set spanning ideating, production, direction and general management, contributing to the entertainment industry’s growth and international recognition.\n\nHer work experience extends across numerous brands like Access Bank, Unilever, Urban Vision, Standard Chartered Bank, and FilmOne Limited. She has contributed to staple African TV series like Tinsel and Halita and has also produced numerous Box Office hits like Toyin Abraham’s Ijakumo, and Okey Bakassi’s Bank Alert. Wingonia Ikpi’s projects are available on top streaming platforms - Netflix, Prime Video, Showmax.\n\nWingonia Ikpi’s deep love for cinema and relatable storytelling continues to manifest in her career trajectory and her approach to filmmaking.",
    "img": "https://res.cloudinary.com/dybmufexj/image/upload/v1753986524/wingonia_q2lswm.svg"
  },
  {
    "name": "Victoria Popoola",
    "role": "Director, Finance",
    "info": "Victoria Popoola is a finance professional with a solid background in data analytics, venture capital and debt financing, and, most recently, creative industry financing. She has invested in and supported early-stage start-ups across various industries in Africa and beyond. Her current focus is on the African creative space where she successfully built financing and investment products at scale for the region. To date, she has raised and managed over 700 million naira in film portfolios with a goal to standardize and overall increase commercial investment in the sector.\n\nShe has a long time passion for creative media, which drives support for creatives who are telling unique, positive African stories. She also believes that storytelling isn’t just entertainment. It’s a way to reshape narratives and celebrate African culture on a global scale. In her new role at Boxonia, she is keen to continue supporting African filmmakers and creators, and to amplify voices that matter.",
    "img": "https://res.cloudinary.com/dybmufexj/image/upload/v1753986522/victoria_rbavph.svg"
  },
  {
    "name": "Iredumare Opeyemi",
    "role": "Director, Legal",
    "info": "Iredumare Opeyemi, is a Managing Partner at Technolawgical Partners, brings extensive experience from roles at Transssion, Transsnet, and MTN Group. He’s overseen 2000 plus business partners and managed five hundred million dollars plus investments across 12 Middle Eastern and African markets for music business (2016–2023).\n\nNotably, he resolved a two million dollars copyright infringement lawsuit and prioritized team collaboration and employee empowerment. Ire is the author of Music Commerce in Africa. He is dedicated to advancing human infrastructure in Africa’s creative industries, driven by passion for results and resilience in the face of challenges.",
    "img": "https://res.cloudinary.com/dybmufexj/image/upload/v1753986518/opeyemi_tjycoo.svg"
  },
  {
    "name": "Onajite Oluwafunke O.",
    "role": "Legal & Business Consultant",
    "info": "Onajite Oluwafunke Odiete is a seasoned Film and TV business executive, entertainment and media lawyer with expertise in film law, content licensing, acquisition, and distribution for both on-demand and pay-TV platforms. Over the years, she has actively secured licensing deals, such as placing a title on Airtel TV, showcasing her ability to navigate both the business and legal aspects of content placement on major platforms. Onajite started her career as a content acquisition intern at Premium Box Office TV, a premier TV network on StarTimes. She currently is a legal and business consultant with Boxonia Blueprint. In this role, she handles a wide range of legal affairs related to film, television, and entertainment, supporting the company’s diverse media ventures across production and distribution.\n\nWith an impressive track record in the media, film, and entertainment industries, Onajite has extensive knowledge of both local and international business and legal frameworks. Her work has contributed to projects that have been featured on major platforms such as Netflix and Amazon Prime. Onajite has provided legal expertise for a variety of productions, including short films, sequels, series, and feature films.\n\nSome of her notable works include Balls, NollyBabes, In a Pod, Gracie, Christmas in Lagos, Blood Sisters (Season 2), Last Cab Home, The One for Sarah, After 30, Oloture: The Journey, Dust to Dreams, and the feature film The Weekend, which was selected for prestigious film festivals worldwide and received 16 nominations at the Africa Movie Academy Awards (AMAA).\n\nIn addition to her production accomplishments, Onajite is deeply committed to elevating local talent within the industry. This is showcased through her contributions to a significant film festival in Nigeria, where she works closely with the programming team to curate a lineup of films that align with the festival's vision while ensuring all legal requirements are met.",
    "img": "https://res.cloudinary.com/dybmufexj/image/upload/v1753986517/oluwafunke_mazpax.svg"
  }
]
