[
  {
    "id": 1,
    "firstName": "taye",
    "lastName": "arimoro",
    "info": "is a professional actor based in Lagos, Nigeria, known for his ability to bring characters to life through his dynamic use of voice, body, actions, and reactions. Taye has a robust portfolio of work in TV, film, and stage productions. He has appeared in notable TV shows such as \"Castle & Castle\" on Ebonylife TV, where he played a pathologist.\n\nTaye Arimoro was lead actor in Niyi Akinmolayan's \"Casa De Novia\" on Prime Video, \"The House of Secrets\", Clarence Peters \"Inside Life\" on Netflix, Inkblot's latest Nigerian football film \"When Love Strikes\", Anthill's \"Criminal\" streaming on Prime Video, \"Last Year Single\" now streaming on Netflix, Russet TV's \"There's Something Wrong with the Bamideles\", \"Son of the Soil\" a Nigerian-UK action thriller directed by Chee Keong (a UK-Chinese director). Taye Arimoro has also been in various television shows including Africa Magic's\n\"Venge\", James Omokwe's \"Ajoche\" and \"The Decision,\" an adaptation of Cinderella.",
    "perks": [
      "professionalism on set",
      "great communication skills",
      "good vibes king",
      "sellability",
      "project to gain marketing support from boxonia blueprint"
    ],
    "relatedProjects": [
      "https://via.placeholder.com/300x180?text=movie+1",
      "https://via.placeholder.com/300x180?text=movie+2"
    ],
    "image": "https://via.placeholder.com/300x300?text=taye+arimoro"
  },
  {
    "id": 2,
    "firstName": "chuks",
    "lastName": "joseph",
    "info": "has become a fan favorite in the Nollywood space and\nbeyond, admired for his charming, witty, smart, and confident\npersonality. To hone his craft as a professional actor, he trained at\nrenowned film institutes, including EbonyLife Creative Academy, Royal\nArts Academy, and the African International Film Festival (AFRIFF)\nacting masterclass. Currently based in Lagos, Chuks is an accomplished\nactor and model with a strong presence in the entertainment industry.\n\nStanding 5’9” with an athletic build, Chuks has appeared in numerous\nblockbuster films (both in cinemas and on streaming platforms), TV\nshows, music videos, commercials, and fashion shows. His notable works include Dark October, The Origin: Madam Koi-Koi, and Afamefuna on Netflix, Criminal on Prime Video,  Leaked and Kokomma on\nYouTube. He also starred in When Love Strikes, Nigeria’s latest football-\nthemed film. On television, Chuks has featured in series such as\nMasquerades of Aniedo, Schooled, Nwanyi Ike, Riona, Baby Drama, and\nFlatmates.\n\nAs a model, Chuks was the first runner-up in the 2020 Mr. Ideal Nigeria\ncompetition, earning the title of Mr. Ideal Nigeria Earth. He has since\nbeen featured in music videos, commercials, and fashion shoots,\nshowcasing his versatility and presence in the modeling world.",
    "perks": [
      "fluent in english and yoruba",
      "Project to Gain Marketing Support from Boxonia Blueprint",
      "sellability",
      "good vibes king",
      "on-time delivery",
      "strong emotional range"
    ],
    "relatedProjects": [
      "https://via.placeholder.com/300x180?text=movie+3",
      "https://via.placeholder.com/300x180?text=movie+4"
    ],
    "image": "https://via.placeholder.com/300x300?text=zainab+balogun"
  },
  {
    "id": 3,
    "firstName": "Oluwadurotimi",
    "lastName": "Okutagidi",
    "info": "is a talented actor celebrated for his versatility in stage plays, feature-length films, and short movies. A graduate of EbonyLife Creative Academy, he has honed his craft through formal training and practical experience. Beyond acting, Oluwadurotimi has also directed personal projects and stage plays, highlighting his multifaceted skills in theater and film.\n\nHis notable acting credits include roles in the upcoming film Everything Scatter directed by Jade Osiberu, Son of the Soil (2024), a Nigerian-UK action thriller by UK-Chinese director Chee Keong, and The Bride Price under Sunom Kura George’s direction. He also stars as James in Mirrors: James’ Split by Arnold Mafo and appeared in Naija Saga (2022) directed by Akinyemi Tag. On stage, Oluwadurotimi delivered compelling performances as Olunde in Death and the King’s Horseman (2022) and as the Second Chief in The Gods Are Not to Blame (2022), both directed by Ayo Ajisafe.\nIn addition to acting, Oluwadurotimi has contributed to projects like the short film Ebiren Re (2024) as Godfrey Williams, directed by Yinka Otubusin, and the TV series Cheta’m (2023) as crew/Apoputara, directed by James Omokwe. With a passion for storytelling and an unwavering dedication to his craft, Oluwadurotimi continues to leave a mark on the entertainment industry.",
    "perks": [
      "screen presence",
      "veteran experience",
      "lead role versatility"
    ],
    "relatedProjects": [
      "https://via.placeholder.com/300x180?text=movie+5"
    ],
    "image": "https://via.placeholder.com/300x300?text=emeka+ike"
  },
  {
    "id": 4,
    "firstName": "Victory",
    "lastName": "Eyong",
    "info": "is a promising young actress steadily making her mark in the film industry. She made her on-screen debut in 2019 with Boxonia’s short film Otana and has since shown unwavering determination to establish herself as a notable talent.\n\nIn 2023, Victory starred in the Nollywood blockbuster Bank Alert, sharing the screen with industry icons like Okey Bakassi, Kanayo O. Kanayo, Kate Henshaw, Taiwo Hassan, and Bolanle Ninolowo. Her passion for acting, coupled with a deep understanding of her craft, positions her as a rising star and a strong contender among her peers.",
    "perks": [
      "calm energy on set",
      "versatile acting",
      "passionate delivery"
    ],
    "relatedProjects": [
      "https://via.placeholder.com/300x180?text=movie+6",
      "https://via.placeholder.com/300x180?text=movie+7"
    ],
    "image": "https://via.placeholder.com/300x300?text=linda+ejiofor"
  },
  {
    "id": 5,
    "firstName": "Ezeani",
    "lastName": "Chinaza",
    "info": ",known as Miss Ezeani, is a multitalented creative and versatile actress known for her enthralling one-woman productions. To further enhance her acting skills,  she attended the prestigious Ebonylife Creative Academy to help kickstart her career as an actor. \n\n\nEzeani has showcased her talent in various notable projects, including James Omokwe's Chetana (Showmax, 2023) Enclosed (2024),\nUriri (African Magic Showcase, 2024),  A Trio's Tale (2024), \nKokumo (2024), an Ebonylife Creative Academy project. \n\nWith several exciting projects in the pipeline, including Omoni Oboli's Cupcakes for Val. Beyond acting, she's a successful influencer, collaborating with top brands like Bolt, TikTok, Itel, Jumia amongst others.\n\n Miss Ezeani’s impressive range of characters has garnered significant attention online and has made her an internet sensation. She is undoubtedly one to look out for in the entertainment industry.",
    "perks": [
      "modern appeal",
      "method acting",
      "adaptive performer"
    ],
    "relatedProjects": [
      "https://via.placeholder.com/300x180?text=movie+8"
    ],
    "image": "https://via.placeholder.com/300x300?text=stan+nze"
  },
  {
    "id": 6,
    "firstName": "bisola",
    "lastName": "ayeola",
    "info": "bisola ayeola is an award-winning actress, host, and singer. her comedic timing and ability to switch roles across genres make her a sought-after talent.",
    "perks": [
      "comic relief",
      "improvisational skills",
      "natural screen chemistry"
    ],
    "relatedProjects": [
      "https://via.placeholder.com/300x180?text=movie+9"
    ],
    "image": "https://via.placeholder.com/300x300?text=bisola+ayeola"
  },
  {
    "id": 7,
    "firstName": "kunle",
    "lastName": "remi",
    "info": "kunle remi is known for action thrillers and romantic films. he has worked with top production houses in nigeria and beyond.",
    "perks": [
      "fitness for action roles",
      "screen adaptability",
      "passionate delivery"
    ],
    "relatedProjects": [
      "https://via.placeholder.com/300x180?text=movie+10"
    ],
    "image": "https://via.placeholder.com/300x300?text=kunle+remi"
  },
  {
    "id": 8,
    "firstName": "uche",
    "lastName": "jumbo",
    "info": "uche jumbo is a writer, producer, and actress with decades of experience in nollywood. she is known for championing women's stories and powerful performances.",
    "perks": [
      "scriptwriting experience",
      "production insight",
      "leadership on set"
    ],
    "relatedProjects": [
      "https://via.placeholder.com/300x180?text=movie+11"
    ],
    "image": "https://via.placeholder.com/300x300?text=uche+jumbo"
  },
  {
    "id": 9,
    "firstName": "falz",
    "lastName": "thebahdguy",
    "info": "falz is a rapper, actor, and comedian whose unique blend of humor and social commentary makes him one of nigeria's most dynamic entertainers.",
    "perks": [
      "multi-talented",
      "comic timing",
      "musical integration"
    ],
    "relatedProjects": [],
    "image": "https://via.placeholder.com/300x300?text=falz"
  },
  {
    "id": 10,
    "firstName": "rita",
    "lastName": "edochie",
    "info": "rita edochie is a seasoned actress with a flair for dramatic mother roles. she is revered in the industry for her consistency and emotional delivery.",
    "perks": [
      "emotional range",
      "role consistency",
      "cultural representation"
    ],
    "relatedProjects": [],
    "image": "https://via.placeholder.com/300x300?text=rita+edochie"
  }
]
